
class Concept ():
	def __init__ (self, name, description):
		self.name = name
		self.description = description
		self.use_description = ''
		self.species = ''
		self.status = ''
	def use (self):
		pass


no_ideas = Concept ('- - - Пусто - - -', "Здесь могла быть какая-то концепция.")
revelation = Concept (' Символ Веры', "Верую во единого Бога, Отца, Вседержителя, Творца неба и земли, всего и видимого и невидимого.  И во единого Господа Иисуса Христа, Сына Божия, Единородного, от Отца рожденного прежде всех веков, Света от Света, Бога истинного от Бога истинного, рожденного, несотворенного, единосущного Отцу, через Которого всё произошло. Ради нас, людей, и нашего ради спасения сошедшего с небес, и воплотившегося от Духа Святого и Марии Девы, и вочеловечившегося. Распятого же за нас при Понтии Пилате, и страдавшего, и погребенного. И воскресшего в третий день, по Писаниям. И восшедшего на небеса, и сидящего справа от Отца.И снова грядущего со славою судить живых и мёртвых, и Царству Его не будет конца. И в Духа Святого, Господа, Животворящего, от Отца исходящего, со Отцом и Сыном равно поклоняемого и славимого, говорившего чрез пророков. Во единую, святую, соборную и апостольскую Церковь. Признаю одно Крещение для прощения грехов. Ожидаю воскресения мёртвых, и жизни будущего века. Аминь.")