zp0 = 'Вы видите грустного одинокого зомби, который жалобно смотрит на вас. Или не на вас - это сложно понять, так как оба его глаза отсутствуют: там где должны быть глазные яблоки у него две ужасных ямы. Однако, кажется, он прекрасно вас чувствует и знает о том, что вы рядом. '

azp0 = 'Что вы сделаете? 1 - поговорить; 2 - напасть; 3 - уйти'

zp10 = '"Приветствую тебя, путник...", зомби жалостливо хрипит выплёвывая свои слова полусгнившими лёгкими'

azp10 = '1 - привет и тебе, зомбяра, как жизнь? 2 - почему ты такой грустный? 3 - не мог бы ты отойти в сторону и дать мне пройти?'

zp110 = '"Очень смешно...", зомби выглядит немного уязвлённо. "Сложно назвать моё тепершнее состояние жизнью. Я, скорее существую. Как камень, или гнилое бревно. Всё, что мне осталось - это постоянное разложение. Гниение - моя судьба, то, на что я обречён. А ведь когда-то я был человеком, радовался жизни, солнцу и свету, чистой воде и вкусному хлебу".'

zp210 = 'Вообще, точно не знаю. Сейчас, когда я мёртв у меня вроде бы и нет поводов грустить - всё уже прошло, а что-то меня словно бы терзает.'

zp310 = 'Я бы с радостью, если бы она у меня была. Но, к сожалению, у меня её нет. Я не могу, у меня нет интереса это делать. Мне совершенно всё безразлично.'

azp110 = '1 - был человеком да сплыл. Сплыл по Стиксу. Так что не парься. Все умирают. 2 - догнивай свой век, желательно побыстрей в каком-нибудь углу. А ну прочь с дороги.'

azp210 = '1 - как тебя зовут? 2 - не мог бы ты отойти с дороги, а то ты мешаешь мне пройти.'

azp310 = '1 - может быть я как-то могу помочь вернуть тебе чувства, чтобы ты нашел в себе силы сдвинуться с места? 2 - тогда мне придётся тебя убить.'

zp1110 = 'О, я не парюсь, мне глубоко всё равно. У меня нет чувств - я всего лишь бесчувственное гнилое бревно лежащее на дороге. Меня даже немного расстраивает то, что ты мог подумать, что я могу быть чем-то обеспокоен.'

zp2110 = 'Нет, с дороги я не уйду. Не хочу. Как впрочем и с тобой разговаривать у меня нет ныне тоже никакого желания.'

zp1210 = 'Зомби задумался: "Да... я, кажется, помню. Меня зовут... Г... Г... Гггг..."'

zp2210 = 'Да, я думаю, что ты мог бы мне помочь, если бы нашёл бы какую-то вещь, которая имела для меня значение. Тогда, возможно, я бы что-то и вспомнил.'

zp1310 = zp2210

zp2310 = 'Что ж, попробуй. Думаю, если ты "убьёшь" меня, хоть это уже само по себе и звучит как нонсенс, то я буду тебе "благодарен", если бы чувство благодарности я мог бы испытывать'

azp1110 = '(1) - Не знаю, похоже ты притворяешься. На самом деле ты весьма эмоциональный зомбяра. Но почему-то ты хочешь играть роль бесцувственного чурбана. (2) - Ясно, ну, тогда я пойду. Видимо, я ничего не смогу здесь сделать.'

zp11110 = '"А вот и нет! Вовсе я не притворяюсь." Зомби явно злится. "Тебе этого не понять, что значит быть зомби."'

azp11110 = '1. Ну вот и доказательство - ты злишься! Следовательно, испытваешь эмоции, следовательно ты не бесчувственный. 2.А каково это быть зомби? 3. Наверное, грустно быть зомби?'

zp111110 = 'Да, я злюсь! И сейчас съем твои мозги... (Зомби кровожадно бросается на вас).'

zp211110 = 'Честно говоря не очень. Бесчувственно, как я уже говорил. Но если ты поможешь найти какие-то воспоминания о моей жизни, может, чувства вернутся ко мне.'

azp211110 = '1 - Да, попробую что-нибудь найти. 2 - Лучше я изрублю тебя на мелкие кусочки!'

zp1211110 = "Вы удаляетесь."

zp2211110 = 'Вы бросаетесь на зомби как коршун на куропатку.'

zp1311110 = 'Зомби впадает в лёгкий ступор. "Да, похоже ты прав. Что ж, ты раскрыл во мне мою истинную эмоциональную сущность. Видимо, теперь я должен удалиться во тьму"'



zp311110 = 'Очень! Тебе и не понять насколько...'

azp311110 = '(1) - Очень? Вот ты и попался..., (2) - Что ж, лучше я пойду'

azp2110 = '1 - уйти; 2 - тогда ты труп! (напасть)'

azp1210 = '1 - Ганс? 2 - Герхардс? 3 - Гоблинсон?'

zp11210 = 'Ганс? Возможно. Не могу знать, мил человек. Память отшибло. Да ещё чеврь какой-то мозг точит. Как раз имя-то и заточил.'
zp21210 = 'Герхард Герхардс? Что-то знакомое. Кажется, где-то я это слышал. Но не помню где.'
zp31210 = '"Да ты что, смеёшься опять? Кто ж такие имена-то носит. Чушь. Конечно, нет." Зомби расстроенно уходит во тьму.'

azp11210 = '1. Уйти. 2. Напасть.'
azp21210 = azp11210
azp31210 = '(Конец разговора) Нажмите Е'

azp2210 = '1 - что ж, я думаю это возможно; 2 - лучше я расправлюсь с тобой, чем буду вступать сделку с нечистой силой.'

zp30 = 'Вы ушли.'
zp20 = 'Вы атакуете.'

empty = '(Конец разговора) Нажмите Е'

zsad0 = 'Вы видите грустного зомби. Он выглядит ещё более расстроенным, чем раньше, он не хочет с вами разговаривать.'

azsad0 = 'Что вы сделаете? 1 - уйти; 2 - напасть.'

zp12210 = 'О, благодарю тебя, добрый паладин! Возвращайся, как найдешь что-то, что тебе покажется моим...'

zhap0 = 'Ну как, успехи?'

have0 = '"О! Я чувствую, что у тебя есть что-то, что принадлежало мне," - зомби затрясся от возбуждения. Картина это, мягко говоря, не самая приятная. Он словно бьётся в конвульсии как умирающий, и из рта у него тонкой струйкой вытекает какая-то жижа.'
ahave0 = '1 - дать ему хлам, который вы взяли из сундука; 2 - уйти.'

have20 = '"Нет, ты не уйдешь! Верни мой хлам!" - зомби страшно вопит и бросается на вас.'

have10 = 'Вы достаёте из вещь-мешка тот мусор, что по какому-то наитию взяли с собой. Зомби жадно выхватывает хлам из ваших рук и прижимает к себе. Начинает его убаюкивать и что-то напевать себе под нос.'

ahave10 = '1 - послушать зомби; 2 - уйти'

have210 = 'Вы разворачиваетесь и уходите. "Что за неуважение к моим чувствам!", слышите вы разъярённый вопль за спиной. Зомби атакует.'

have110 = 'Да, вот это черпеки того горшка, из которого я пил, а это остатки куколки моей дочурки, а вот частицы мышей, которые жили в нашем доме.. да... вспоминаю.'
ahave110 = '1 - слушать дальше; 2 - уйти'
have1110 = 'Был я простым крестьянином. Неказистая жизнь. Работа с детства, голод. То разбойники, то ещё какие напасти. Бог дал - женился. Сын родился. Кормил-кормил, ростил-ростил его, питал-питал, а в 12-ть лет он помер от заразы какой-то. А я работал в поле: пахал, сеял. Почва каменистая у нас, правда, была - родила мало. Но кое-как справляли концы с концами. Дожил я до преклонных лет и к 30-ти годам сам помер от чумы.'
ahave1110 = '1 - слушать дальше; 2 - уйти'
have11110 = 'Завершив свой рассказ зомби растянул свой рот в страшной улыбке, после чего весь раскис и оплыл на землю, превратившись в лужу.'


text = [

{

 0: (zp0, 'next', azp0),
  10: (zp10, "next", azp10),
    110 : (zp110, 'next', azp110),
     1110 : (zp1110, 'next', azp1110),
     2110 : (zp2110, 'next', azp2110),
      12110 : (zp30, 'quest', empty,('go', 1)),
      22110 : (zp20, 'war', empty),
    210: (zp210, 'next', azp210),
     1210 : (zp1210, 'next', azp1210),
      11210 : (zp11210, 'next', azp11210),
          111210 : (zp30, 'end', empty, ('go', 1)),
          211210 : (zp20, 'war', empty),      
      21210 : (zp21210, 'next', azp11210),
          121210 : (zp30, 'end', empty, ('go', 1)),
          221210 : (zp20, 'war', empty),
      31210 : (zp31210, 'solve', empty, ('go', 1)),
     2210 : (zp2210, 'end', azp2210),
      12210 : (zp12210, 'quest', empty, ('go',2)),
      22210 : (zp20, "war", empty),
    310: (zp310, 'next', azp310),
     1310 : (zp1310, 'quest', empty, ('go', 2)),
     2310 : (zp2310, 'end', empty, ('go', 1)),    
  20: (zp20, "war", empty),
  30: (zp30, 'end', empty, ('go', 0)), 
  11110 : (zp11110, 'next', azp11110),
111110 : (zp111110, 'war', empty),
211110 : (zp211110, 'next', azp211110),
1211110: (zp1211110, 'end', empty, ('go', 2)),
2211110 : (zp2211110, 'war', empty),
311110 : (zp311110, 'next', azp311110),
1311110 : (zp1311110, 'solve', empty, ('go', 1)),
2311110 : (zp1211110, 'end', empty, ('go', 1))
},

{
  0: (zsad0, 'next', azsad0),
   10: (zp30, 'end', empty,('go', 1)),
   20: (zp20, "war", empty)
},

{
  0: (zhap0, 'next', azsad0),
   10: (zp30, 'end', empty,('go', 1)),
   20: (zp20, "war", empty)
},

{
  0: (have0, 'next', ahave0),
   10: (have10, 'garbage', ahave10),
    110: (have110, 'next', ahave110),
      1110:(have1110, 'next', ahave110),
        11110:(have11110, 'zombidead', empty),
        21110:(have210, 'war', empty),
      2110:(have210, 'war', empty),

    210: (have210, 'war', empty),
   20: (have20, "war", empty)
}
]


